app/controllers/campaigns_controller.rb

  def index
    @campaigns = Campaign.all.order(id: :asc)
---
SELECT "campaigns".* FROM "campaigns"  ORDER BY "campaigns"."id" DESC