app/controllers/general_controller.rb

DELETE FROM "conversions" WHERE "conversions"."id" = $1  [["id", 1]]
DELETE FROM "clicks" WHERE "clicks"."id" = $1  [["id", 1]]
DELETE FROM "banners" WHERE "banners"."id" = $1  [["id", 1]]
DELETE FROM "campaigns" WHERE "campaigns"."id" = $1  [["id", 5]]
---
  def clean_data
    begin
      ActiveRecord::Base.transaction do
        Conversion.destroy_all
        Click.destroy_all
        Banner.destroy_all
        Campaign.destroy_all