app/views/campaigns/index.html.erb

SELECT COUNT(*) FROM "banners" INNER JOIN "banners_campaigns" ON "banners"."id" = "banners_campaigns"."banner_id" WHERE "banners_campaigns"."campaign_id" = $1  [["campaign_id", 1]]
---
          <td><%= campaign.id %></td>
          <td><%= campaign.banners.size %></td>